//Наконец-то нормальная задача
//Вам дано число. Требуется расставить между его цифр операции +, - и * таким образом, чтобы значение полученного выражения было максимально.
//
//Входные данные
//В первой строке записано единственное целое число a.
//
//Выходные данные
//Выведите оптимальное выражение.
//
//Sample Input:
//9434
//
//Sample Output:
//9434

#include <iostream>

int main()
{
    std::string result;
    std::cin >> result;
    std::cout << result;
}