//Реферат
//Закон внешнего мира, общеизвестно, искажает возрастающий принцип восприятия. Гедонизм нетривиален. Умножение вектора на число рефлектирует критерий интегрируемости. Исчисление предикатов определяет интеграл Гамильтона, в итоге приходим к логическому противоречию. Дифференциальное исчисление проецирует натуральный логарифм. Наряду с этим замкнутое множество привлекает вектор, откуда следует доказываемое равенство. Гравитационный парадокс, следовательно, раскручивает предел функции. Рассмотрим непрерывную функцию  y = f (x), заданную на отрезке [a, b], дедуктивный метод отражает скачок функции. Отношение к современности решительно понимает под собой дуализм, при этом буквы А, В, I, О символизируют соответственно общеутвердительное, общеотрицательное, частноутвердительное и частноотрицательное суждения. Ато джива, следовательно, амбивалентно притягивает убывающий вектор, не учитывая мнения авторитетов. Частная производная усиливает метод последовательных приближений, хотя в официозе принято обратное. Тем не менее, непрерывная функция представляет собой равновероятный интеграл по ориентированной области, в итоге приходим к логическому противоречию. Точка перегиба принимает во внимание язык образов. Достаточное условие сходимости проецирует действительный язык образов. Более того, антропосоциология осмысленно транспонирует структурализм. Учитывая, что (sin x)’ = cos x, ряд Тейлора решительно преобразует сложный структурализм. Конфликт, в первом приближении, упорядочивает закон внешнего мира. Искусство, исключая очевидный случай, амбивалентно допускает интеллигибельный интеграл Пуассона. Интересно отметить, что математический анализ прост. Моцзы, Сюнъцзы и другие считали, что импликация неоднозначна. Ввиду непрерывности функции f ( x ), линейное программирование упорядочивает трансцендентальный интеграл Пуассона. Интеграл Дирихле нейтрализует метод последовательных приближений. Вероятностная логика философски заполняет стремящийся полином. Исчисление предикатов понимает под собой метод последовательных приближений. Априори, концепция стремительно рефлектирует дедуктивный метод. Нормальное распределение, конечно, контролирует ортогональный определитель. Отношение к современности понимает под собой трагический интеграл по поверхности. Несмотря на сложности, предмет деятельности накладывает субъективный критерий интегрируемости, изменяя привычную реальность. Идеи гедонизма занимают центральное место в утилитаризме Милля и Бентама, однако смысл жизни создает интеграл от функции, обращающейся в бесконечность в изолированной точке, открывая новые горизонты. Медиапланирование, безусловно, тормозит отраслевой стандарт. Как отмечает Майкл Мескон, педотрансферная функция поступательно искажает минерал. К тому же суффозия физически восстанавливает экспериментальный имидж. В случае смены водного режима создание приверженного покупателя одномерно тормозит ламинарный агрегат. Прибор Качинского ускоряет сегмент рынка. Шурф, на первый взгляд, стабилизирует экспериментальный гончарный дренаж, вне зависимости от предсказаний теоретической модели явления. Как мы уже знаем, сдавливание порождает конструктивный журавчик, осознавая социальную ответственность бизнеса. В связи с этим нужно подчеркнуть, что фрактал стекает в экспериментальный прибор Качинского. Искусство медиапланирования нетривиально. Согласно последним исследованиям, нишевый проект отражает дренаж. Правда, специалисты отмечают, что пул лояльных изданий неизменяем. Повышение жизненных стандартов допускает неоднородный ортзанд. В лабораторных условиях было установлено, что концепция новой стратегии генетически индуцирует product placement. Принимая во внимание искусственность границ элементарной почвы и произвольность ее положения в пространстве почвенного покрова, подзол ригиден как никогда. На завтрак англичане предпочитают овсяную кашу и кукурузные хлопья, тем не менее аналогия закона наследует гарант. Для пользования телефоном-автоматом необходимы разменные монеты, однако санитарный и ветеринарный контроль установлен обычаями делового оборота. В ресторане стоимость обслуживания (15%) включена в счет; в баре и кафе - 10-15% счета только за услуги официанта; в такси - чаевые включены в стоимость проезда, тем не менее страховой полис латентно законодательно подтверждает уголовный круговорот машин вокруг статуи Эроса. Отгонное животноводство, как бы это ни казалось парадоксальным, мгновенно. Гарант последовательно декларирует действующий вулкан Катмаи. Солнечная радиация защищает индоссамент. В соответствии с общим принципом, установленным Конституцией РФ, денежная единица традиционно берёт международный Суэцкий перешеек, даже с учетом публичного характера данных правоотношений. Акционерное общество, как бы это ни казалось парадоксальным, изящно выбирает ничтожный коносамент. Делькредере притягивает живописный Суэцкий перешеек. Оферта, при ближайшем рассмотрении, уязвима. Мягкая зима, несмотря на то, что есть много бунгало для проживания, надкусывает суд, хотя законодательством может быть установлено иное. Причиненный ущерб бесспорен. Очаг многовекового орошаемого земледелия, при ближайшем рассмотрении, изящно просветляет гарантийный кредитор. Средиземноморский кустарник своевременно исполняет Дом-музей Риддера Шмидта (XVIII в.). Франшиза несанкционированно оформляет портер. В самом общем случае граница перевозит акционерный памятник Нельсону, что часто служит основанием изменения и прекращения гражданских прав и обязанностей.
//
//Представьте себе, что вас заставили читать бессмысленное полотно текста. У преподавателей часто бывает такое чувство, когда они читают реферат какого-нибудь студента. Так случилось с Михаилом Евгеньевичем. Он настолько устал от этих рефератов, что уже согласен выставлять оценку только за количество слов и строк в тексте, и вы должны ему в этом помочь.
//
//Входные данные
//Во входных данных записан некоторый текст, состоящий из символов латинского алфавита, цифр, пробелов и переводов строк.
//
//Выходные данные
//Выведите два числа - количество непустых строк и непустых слов в данном тексте. Словом считается любая последовательность букв и цифр, ограничивающихся началом текста, концом текста, либо пробельными символами.
//
//Примечание
//Для локального тестирования полезно уметь вводить признак конца ввода. Это делается комбинацией клавиш ctrl+D в Линуксе и ctrl+Z в Windows. Если ни одна из этих комбинаций не подходит - воспользуйтесь запуском Степика, в нем проблемы с концом файла нет, поскольку нет интерактивного взаимодействия.
//
//Sample Input:
//
//
//Hello my name is Vlad
//        And i tell    your are story
//
//        about     my     brilliant
//english
//
//
//Sample Output:
//4 15

#include <string>
#include <sstream>
#include <iostream>

using namespace std;

int main()
{
    int word_count = 0;
    int string_count = 0;

    while (!cin.eof())
    {
        string str;
        getline(cin, str);

        if (!str.empty()
            && (str.find_first_not_of(' ') != string::npos)) {
            ++string_count;
            istringstream ist(str);
            for (string word; ist >> word; ++word_count);
        }
    }

    cout << string_count << ' ' << word_count;
}