//Куда бы указать?
//На черном рынке вы добыли два указателя. По законам вашей страны с собой нельзя носить больше одного указателя, поэтому вы решили пойти на хитрость - сделать так, чтобы эти два указателя указывали в одно место: так поймавший вас жандарм может принять их за один. Сделайте это!
//
//Техническая часть
//Вам необходимо написать часть программы, в результате работы которой два объявленных выше указателя начинают указывать на одно и то же место в памяти. Гарантируется, что выше объявлено два указателя ptr1 и ptr2, оба имеют тип int*.

ptr1 = ptr2;