//Произведение чисел
//Необходимо написать функцию, которая выводит произведение чисел на экран.
//
//Входные данные
//Вам требуется написать функцию, которая называется product, принимает два целых числа.
//
//Выходные данные
//Функция должна вывести на экран произведение данных чисел.

void product(const long int &first, const long int &second)
{
    cout << first * second;
}