//Сумма чисел
//В этой задаче вам даны два числа, требуется найти их сумму.
//
//Входные данные
//Входные данные содержат два целых числа a, b.
//
//Выходные данные
//Найдите сумму двух данных чисел
//
//Sample Input 1:
//5 14
//
//Sample Output 1:
//19
//
//Sample Input 2:
//381 492
//
//Sample Output 2:
//873

#include <iostream>

using namespace std;

int main()
{
    long int a, b;
    cin >> a >> b;
    cout << a + b;
}