//Произведение чисел
//В этой задаче требуется найти произведение двух целых чисел
//
//Входные данные
//Входные данные содержат два целых числа a, b.
//
//Выходные данные
//В ответ напишите произведение данных чисел.
//
//Sample Input 1:
//2 3
//
//Sample Output 1:
//6
//
//Sample Input 2:
//100 200
//
//Sample Output 2:
//20000

#include <iostream>

using namespace std;

int main()
{
    long int a, b;
    cin >> a >> b;
    cout << a * b;
}