//Сумма чисел
//В этой задаче необходимо найти сумму двух целых чисел.
//
//Входные данные
//Входные данные содержат два целых числа a, b.
//
//Выходные данные
//В ответ напишите сумму данных чисел
//
//Sample Input 1:
//2 3
//
//Sample Output 1:
//5
//
//Sample Input 2:
//9000000000000000000 9000000000000000000
//
//Sample Output 2:
//18000000000000000000

#include <iostream>

using namespace std;

int main()
{
    unsigned long a, b;
    cin >> a >> b;
    cout << a + b;
}