//Интересный делитель
//Интересным делителем называется число N, которое является делителем числа N + 1. Вам требуется найти количество интересных делителей на отрезке от L до R, концы отрезка включаются.
//
//Входные данные
//Во входном файле записано через пробел два числа L и R.
//
//Выходные данные
//Вывести единственное число — ответ на задачу.
//
//Sample Input:
//2 5
//
//Sample Output:
//0

#include <iostream>

int main()
{
    unsigned L;
    std::cin >> L;
    std::cout << (L == 1);
}