//Первая цифра числа
//Выпишите первую цифру данного числа.
//
//Входные данные
//Входные данные содержат единственное целое число a.
//
//Выходные данные
//В ответ запишите первую цифру введенного числа.
//
//Sample Input 1:
//93099339395097728908
//
//Sample Output 1:
//9
//
//Sample Input 2:
//560
//
//Sample Output 2:
//5

#include <iostream>

using namespace std;

int main ()
{
    char a;
    cin >> a;
    cout << a;
}