//Таблица истинности
//Дмитрию на уроке по информатике задали построить таблицу истинности следующего выражения: a ИЛИ !a ИЛИ b И (c ИЛИ b И !a). К сожалению, Дмитрий слишком ленив, чтобы самому ее строить, поэтому он попросил вас ему помочь. Для данных a, b, c определите значение выражения.
//
//Входные данные
//Входные данные содержат три целых числа a, b, c.
//
//Выходные данные
//Выведите число 0 или 1 - значение выражения при данных переменных a, b и c.
//
//Примечание
//В этой задаче запрещено пользоваться условным оператором.
//
//Sample Input 1:
//1 0 1
//
//Sample Output 1:
//1
//
//Sample Input 2:
//0 1 1
//
//Sample Output 2:
//1

#include <iostream>

using namespace std;

int main ()
{
    cout << true;
}