//Равно нулю?
//В этой задаче требуется проверить, что число не равно нулю.
//
//Входные данные
//Входные данные содержат единственное целое число.
//
//Выходные данные
//Выведите 1, если число не равно 0 и 0 иначе.
//
//Примечание
//В этой задаче запрещено использовать условный оператор.
//
//Sample Input 1:
//10
//
//Sample Output 1:
//1
//
//Sample Input 2:
//-1000000000
//
//Sample Output 2:
//1

#include <iostream>

using namespace std;

int main()
{
    bool a;
    cin >> a;
    cout << a;
}